; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-2-31)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-1 - location
	p0-2 - location
	p3-0 - location
	p3-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s2)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at package1 s3)
	(at package2 s2)
	(at package3 s1)
	(at package4 s1)
	(at package5 s3)
	(at package6 s2)
	(at package7 s1)
	(at package8 s2)
	(at package9 s3)
	(at package10 s1)
	(at package11 s3)
	(at package12 s0)
	(at package13 s2)
	(at package14 s3)
	(at package15 s0)
	(at package16 s1)
	(at package17 s1)
	(at package18 s2)
	(at package19 s0)
	(at package20 s1)
	(at package21 s0)
	(at package22 s2)
	(at package23 s2)
	(at package24 s3)
	(at package25 s3)
	(at package26 s2)
	(at package27 s1)
	(at package28 s3)
	(at package29 s0)
	(at package30 s0)
	(at package31 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(link s1 s0)
	(link s0 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s0)
	(link s0 s3)
)
	(:goal (and
	(at driver1 s2)
	(at truck1 s0)
	(at truck2 s1)
	(at package1 s3)
	(at package2 s2)
	(at package3 s0)
	(at package4 s0)
	(at package5 s1)
	(at package6 s0)
	(at package7 s3)
	(at package8 s1)
	(at package9 s0)
	(at package10 s1)
	(at package11 s1)
	(at package13 s1)
	(at package14 s3)
	(at package15 s3)
	(at package16 s1)
	(at package17 s3)
	(at package19 s1)
	(at package20 s2)
	(at package21 s2)
	(at package22 s3)
	(at package23 s1)
	(at package24 s1)
	(at package25 s1)
	(at package26 s3)
	(at package27 s0)
	(at package28 s3)
	(at package29 s3)
	(at package30 s1)
	(at package31 s1)
	))


)

; plan
1. (walk driver2 s2 p0-2)
   deleted: (at driver2 s2)
   added: (at driver2 p0-2)
   goals met: 7 of 32
2. (walk driver2 p0-2 s0)
   deleted: (at driver2 p0-2)
   added: (at driver2 s0)
   goals met: 7 of 32
3. (board-truck driver2 s0 truck2)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 32
4. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 8 of 32
5. (walk driver3 s2 p3-2)
   deleted: (at driver3 s2)
   added: (at driver3 p3-2)
   goals met: 8 of 32
6. (walk driver3 p3-2 s3)
   deleted: (at driver3 p3-2)
   added: (at driver3 s3)
   goals met: 8 of 32
7. (board-truck driver3 s3 truck1)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 8 of 32
8. (load-truck s3 package9 truck1)
   deleted: (at package9 s3)
   added: (in package9 truck1)
   goals met: 8 of 32
9. (drive-truck driver3 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 9 of 32
10. (unload-truck s0 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s0)
   goals met: 10 of 32
11. (load-truck s0 package30 truck1)
   deleted: (at package30 s0)
   added: (in package30 truck1)
   goals met: 10 of 32
12. (load-truck s0 package29 truck1)
   deleted: (at package29 s0)
   added: (in package29 truck1)
   goals met: 10 of 32
13. (drive-truck driver3 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 9 of 32
14. (load-truck s3 package5 truck1)
   deleted: (at package5 s3)
   added: (in package5 truck1)
   goals met: 9 of 32
15. (drive-truck driver3 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 10 of 32
16. (load-truck s0 package21 truck1)
   deleted: (at package21 s0)
   added: (in package21 truck1)
   goals met: 10 of 32
17. (drive-truck driver3 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 9 of 32
18. (drive-truck driver3 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 9 of 32
19. (load-truck s2 package8 truck1)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 9 of 32
20. (load-truck s2 package6 truck1)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   goals met: 9 of 32
21. (load-truck s2 package26 truck1)
   deleted: (at package26 s2)
   added: (in package26 truck1)
   goals met: 9 of 32
22. (drive-truck driver3 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 9 of 32
23. (load-truck s3 package31 truck1)
   deleted: (at package31 s3)
   added: (in package31 truck1)
   goals met: 9 of 32
24. (drive-truck driver3 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 10 of 32
25. (unload-truck s0 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s0)
   goals met: 11 of 32
26. (load-truck s0 package19 truck1)
   deleted: (at package19 s0)
   added: (in package19 truck1)
   goals met: 11 of 32
27. (load-truck s0 package15 truck1)
   deleted: (at package15 s0)
   added: (in package15 truck1)
   goals met: 11 of 32
28. (drive-truck driver3 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 10 of 32
29. (drive-truck driver3 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 10 of 32
30. (load-truck s2 package23 truck1)
   deleted: (at package23 s2)
   added: (in package23 truck1)
   goals met: 10 of 32
31. (load-truck s2 package22 truck1)
   deleted: (at package22 s2)
   added: (in package22 truck1)
   goals met: 10 of 32
32. (unload-truck s2 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s2)
   goals met: 11 of 32
33. (drive-truck driver3 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 11 of 32
34. (unload-truck s3 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s3)
   goals met: 12 of 32
35. (drive-truck driver3 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 13 of 32
36. (load-truck s1 package7 truck2)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   goals met: 13 of 32
37. (load-truck s1 package4 truck2)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   goals met: 13 of 32
38. (load-truck s1 package3 truck2)
   deleted: (at package3 s1)
   added: (in package3 truck2)
   goals met: 13 of 32
39. (load-truck s1 package27 truck2)
   deleted: (at package27 s1)
   added: (in package27 truck2)
   goals met: 13 of 32
40. (load-truck s1 package20 truck2)
   deleted: (at package20 s1)
   added: (in package20 truck2)
   goals met: 13 of 32
41. (load-truck s1 package17 truck2)
   deleted: (at package17 s1)
   added: (in package17 truck2)
   goals met: 13 of 32
42. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 12 of 32
43. (drive-truck driver2 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 12 of 32
44. (drive-truck driver3 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 11 of 32
45. (unload-truck s1 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s1)
   goals met: 12 of 32
46. (unload-truck s1 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   goals met: 13 of 32
47. (unload-truck s1 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s1)
   goals met: 14 of 32
48. (drive-truck driver3 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 15 of 32
49. (unload-truck s3 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   goals met: 16 of 32
50. (load-truck s3 package25 truck2)
   deleted: (at package25 s3)
   added: (in package25 truck2)
   goals met: 16 of 32
51. (load-truck s3 package24 truck2)
   deleted: (at package24 s3)
   added: (in package24 truck2)
   goals met: 16 of 32
52. (drive-truck driver2 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 16 of 32
53. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 17 of 32
54. (unload-truck s1 package25 truck2)
   deleted: (in package25 truck2)
   added: (at package25 s1)
   goals met: 18 of 32
55. (unload-truck s1 package24 truck2)
   deleted: (in package24 truck2)
   added: (at package24 s1)
   goals met: 19 of 32
56. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 18 of 32
57. (drive-truck driver3 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 17 of 32
58. (unload-truck s3 package26 truck1)
   deleted: (in package26 truck1)
   added: (at package26 s3)
   goals met: 18 of 32
59. (unload-truck s3 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s3)
   goals met: 19 of 32
60. (drive-truck driver3 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 20 of 32
61. (drive-truck driver3 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 19 of 32
62. (unload-truck s1 package30 truck1)
   deleted: (in package30 truck1)
   added: (at package30 s1)
   goals met: 20 of 32
63. (unload-truck s1 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s1)
   goals met: 21 of 32
64. (unload-truck s1 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s1)
   goals met: 22 of 32
65. (drive-truck driver3 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 23 of 32
66. (drive-truck driver3 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 22 of 32
67. (unload-truck s3 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s3)
   goals met: 23 of 32
68. (load-truck s3 package11 truck1)
   deleted: (at package11 s3)
   added: (in package11 truck1)
   goals met: 23 of 32
69. (drive-truck driver3 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 24 of 32
70. (drive-truck driver3 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 23 of 32
71. (unload-truck s1 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s1)
   goals met: 24 of 32
72. (unload-truck s0 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s0)
   goals met: 25 of 32
73. (unload-truck s0 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 26 of 32
74. (unload-truck s0 package27 truck2)
   deleted: (in package27 truck2)
   added: (at package27 s0)
   goals met: 27 of 32
75. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 28 of 32
76. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 27 of 32
77. (drive-truck driver3 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 28 of 32
78. (unload-truck s2 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s2)
   goals met: 29 of 32
79. (load-truck s2 package13 truck2)
   deleted: (at package13 s2)
   added: (in package13 truck2)
   goals met: 29 of 32
80. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 30 of 32
81. (unload-truck s1 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s1)
   goals met: 31 of 32
82. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 30 of 32
83. (drive-truck driver2 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 30 of 32
84. (unload-truck s3 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s3)
   goals met: 31 of 32
85. (drive-truck driver2 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 31 of 32
86. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 32 of 32
